* idea : create an ocaml functional agent for talking to llms.

#+begin_src shell
  opam install --yes ppx_yojson_conv_lib ppx_yojson_conv
  opam install --yes ppx_yojson lwt_ppx containers lambdasoup uri ezcurl ppx_yojson_conv ppx_yojson_conv_lib ezcurl-lwt yojson
 opam pin add --yes openai https://github.com/meta-introspector/openai-ocaml.git#main
  opam install --yes --deps-only .

  dune build .
#+end_src

#+RESULTS:
| [openai.0.0.1]    | synchronised | (no  | changes) |      |                                                                |          |        |         |       |             |
| openai            | is           | now  | pinned   | to   | git+https://github.com/meta-introspector/openai-ocaml.git#main | (version | 0.0.1) |         |       |             |
|                   |              |      |          |      |                                                                |          |        |         |       |             |
| Already           | up-to-date.  |      |          |      |                                                                |          |        |         |       |             |
| Nothing           | to           | do.  |          |      |                                                                |          |        |         |       |             |
| #                 | Run          | eval | $(opam   | env) | to                                                             | update   |    the | current | shell | environment |
| [lang_agent.~dev] | synchronised | (no  | changes) |      |                                                                |          |        |         |       |             |

Optional coq 
#+begin_src shell
 opam install --yes coq
#+end_src

#+begin_src shell
dune exec bin/argiope.exe "https://writemycode.com/?goal=snakegame" -- -m mistral
#+end_src

#+begin_src shell
dune exec -- ./bin/argiope.exe https://github.com/meta-introspector/lang_agent/blob/3d485ff60e2872cbb920980a5fd2dbde908215ed/bin/argiope.ml#L28?q="argiope is a virtual hyperspace navigation simulator" -m mistral
#+end_src

* scanner
#+begin_src shell
dune exec bin/scanner.exe -- -s ~/experiments/unimath-data-hg/unimath/batch2/ -p "think about this:"
#+end_src

#+begin_src shell
      dune exec bin/scanner.exe --  -s ./huggingface/unimath/batch2/data_30/       -p "Consider the following valid trace of a COQ proof in unimath and interpret it creatively:"  --openai -m mistral
#+end_src

#+RESULTS:
: DEBUG ./huggingface/unimath/batch2/data_30/


* simple
try with 'org-babel-eval-in-repl
#+begin_src shell
  dune exec ./bin/simple.exe -- --openai -m "mixtral" -u "https://dev-hub.agentartificial.com" -p "consider a consecutive series of types to describe the universe and universe of universes, what is your ordering?" -n 10
#+end_src

#+begin_src ocaml
#load "unix.cma";;
#+end_src

#+RESULTS:
: Line 1, characters 0-1:
: 1 | \#load "unix.cma";;;;
:     ^
: Error: Illegal character (\\)

#+begin_src ocaml

  let type_terms = [
  "set";
  "type";
  "sort"
                   ] in
  let model_name = "mixtral" in
  let url= "https://dev-hub.agentartificial.com"
  let prompt type_name = "consider a " ^
               "consecutive series "^
               "of " ^ type_name ^
               "to describe " ^
               "the universe and universe of universes" ^
               "what is your ordering?" in

  let count= 10 in
  let simple = "dune exec ./bin/simple.exe --" in
  let binding = "--openai"

  let do_apply_list    run_cmd make_args type_terms   =
    List.iter (fun s ->
        let args = make_args s in
        run_cmd args
      ) type_terms;;

  let make_args type_name = [
    simple;
    binding;
    "-m";    model;
    "-p";    prompt type_name;
    "-u";    url;
  ] in
  let run_cmd args =
    let cmd =  String.concat " " args in
    let inp = Unix.open_process_in cmd in
    let r = In_channel.input_lines inp in
    In_channel.close inp;
    let out = String.concat " " r in
    Printf.printf "Output: %s\n" out

  let () =
    do_apply_list run_cmd make_args type_terms  
    Printf.printf "Args: %s\n" args
#+end_src

#+RESULTS:
: Line 17, characters 0-3:
: 17 | let () =
:      ^^^
: Error: Syntax error


* recurse

#+begin_src shell
  dune exec ./bin/recurse.exe -- --openai -m "mixtral" \
       -u "https://dev-hub.agentartificial.com" \
       -s "recurse2"  \
       -x ".txt" \
       -p "consider a consecutive series of propositions to describe the universe and universe of universes. Consider your previous output and continue the thought if there, otherwise start a new thought chain." \
       -n 10
#+end_src

#+RESULTS:
| DEBUG3                   | path         | recurse2 |
| DEBUG4                   | MODEL        | :mixtral |
| Consider:mixtralrecurse2 |              |          |
| OUTPUT:                  | recurse2.txt |          |
| OUTPUT:                  | recurse2.txt |          |
| OUTPUT:                  | recurse2.txt |          |
| OUTPUT:                  | recurse2.txt |          |
| OUTPUT:                  | recurse2.txt |          |
| OUTPUT:                  | recurse2.txt |          |
| OUTPUT:                  | recurse2.txt |          |
| OUTPUT:                  | recurse2.txt |          |
| OUTPUT:                  | recurse2.txt |          |
| OUTPUT:                  | recurse2.txt |          |

